In [1]:
import pandas as pd
import numpy as np

In [5]:
data = [1000, 2000, 3000]
index =['메로나', '구구콘', '라면']
s_data = pd.Series(data = data, index = index)

s_data.iloc[0:2]

메로나    1000
구구콘    2000
dtype: int64

In [6]:
s_data.loc[['메로나', '구구콘']]

메로나    1000
구구콘    2000
dtype: int64

In [8]:
# 시리즈 객체는 파이썬 리스트와 달리 연속적이지 않은 값들에 대해서도 슬라이싱을 할 수 있음

indice = [0,2]

s_data[indice]

C:\Users\imtig\AppData\Local\Temp\ipykernel_30620\1434270168.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s_data[indice]

메로나    1000
라면     3000
dtype: int64

# 3.6 시리즈 수정 / 추가 / 삭제

In [9]:
from pandas import Series

In [11]:
s_data

메로나    1000
구구콘    2000
라면     3000
dtype: int64

In [13]:
s_data['라면'] = '4000'

s_data

메로나    1000
구구콘    2000
라면     4000
랴면     4000
dtype: object

In [14]:
s_data.iloc[0] = 500

s_data

메로나     500
구구콘    2000
라면     4000
랴면     4000
dtype: object

In [15]:
s_data.loc['비빅']  = 500 # 값 추가

In [19]:
s_data['랴면'] = 500
s_data = s_data.drop('랴면')

# drop 메서드는 시리즈의 원본 데이터를 제거하지 않고 새로운 시리즈 객체를 반환하는 것에 유의해야함

In [20]:
s_data

메로나     500
구구콘    2000
라면     4000
비빅      500
dtype: object

In [21]:
s_data

메로나     500
구구콘    2000
라면     4000
비빅      500
dtype: object

# 시리즈 연산

##### 시리즈는 넘파이와 동일하게 브로드 캐스팅이 적용되며, 같은 인덱스를 갖는 데이터끼리 연산을 수행

In [24]:
Cheol = pd.Series([10,20,30], index = ['Naver','SKT','KT'])
Young = pd.Series([10,20,30], index = ['SKT','KT', "Naver"])

Cheol+Young

KT       50
Naver    40
SKT      30
dtype: int64

In [25]:
# 브로드 캐스팅

Cheol * 10

Naver    100
SKT      200
KT       300
dtype: int64

In [26]:
high = pd.Series([42800,42700,42050,42950,43000])
low = pd.Series([42150, 42150, 41300, 42150, 42350])

diff = high-low

diff

0    650
1    550
2    750
3    800
4    650
dtype: int64

In [28]:
diff.max()

800

In [29]:
date = ['2024-06-01','2024-06-02','2024-06-03','2024-06-04','2024-06-05']

high = pd.Series([42800,42700,42050,42950,43000], index =date)
low = pd.Series([42150,42150,41300,42150,42350], index = date)

diff = high - low

diff

2024-06-01    650
2024-06-02    550
2024-06-03    750
2024-06-04    800
2024-06-05    650
dtype: int64

In [32]:
max_idx = 0
max_val = 0

for i in diff.index:
    if diff.loc[i]> max_val:
        max_val = diff.loc[i]
        max_idx = i
        
print(max_idx)
print(diff.loc[max_idx])

# 성장했다.

2024-06-04
800

##### 시리즈는 최댓값일 때의 인덱스를 반환하는 idxmax와
##### 최솟값일 때의 인덱스를 반환하는 idxmin 메서드를 제공합니다.

In [33]:
print(diff.idxmax())
print(diff.idxmin())

2024-06-04
2024-06-02

##### 매일 저가에서 사서 고가에 산다면

In [34]:
profit = high / low
profit

2024-06-01    1.015421
2024-06-02    1.013049
2024-06-03    1.018160
2024-06-04    1.018980
2024-06-05    1.015348
dtype: float64

In [36]:
print(profit.cumprod())

2024-06-01    1.015421
2024-06-02    1.028671
2024-06-03    1.047351
2024-06-04    1.067230
2024-06-05    1.083610
dtype: float64

In [37]:
# 마지막 값 출력

profit.cumprod().iloc[-1]

1.0836101509172456

In [40]:
data ={
    
    "삼성전자": "전기,전자",
    "LG전자": "전기,전자",
    "현대차":"운수장비",
    "NAVER":"서비스업",
    "카카오":"서비스업"
    
}

s = pd.Series(data)

s

삼성전자     전기,전자
LG전자     전기,전자
현대차       운수장비
NAVER     서비스업
카카오       서비스업
dtype: object

In [41]:
s.unique()

array(['전기,전자', '운수장비', '서비스업'], dtype=object)

In [43]:
s.value_counts()

# value_counts(): 시리즈의 values 중 유일한 값을 ndarray로 반환

전기,전자    2
서비스업     2
운수장비     1
Name: count, dtype: int64

In [44]:
s.unique()

array(['전기,전자', '운수장비', '서비스업'], dtype=object)

In [45]:
s.value_counts()

전기,전자    2
서비스업     2
운수장비     1
Name: count, dtype: int64

In [49]:
def remove_comma(x):
    
    print(x, "in function")
    return x

s = pd.Series(["1,234","5,678","9,876"])

result = s.map(remove_comma)

print(result)

1,234 in function
5,678 in function
9,876 in function
0    1,234
1    5,678
2    9,876
dtype: object

In [51]:
def remove_comma(x):
    
    return int(x.replace(',',''))

s =pd.Series(['1,234','5,678','9,876'])

result = s.map(remove_comma)

result

# replace 메서드로 콤마를 제거하고 int함수로 타입 변경

0    1234
1    5678
2    9876
dtype: int64

In [52]:
def remove_comma(x):
    
    return int(x.replace(',',''))

s = pd.Series(['1,234','5,678','9,876'])

result = s.map(remove_comma)

print(result)

0    1234
1    5678
2    9876
dtype: int64

In [53]:
from pandas import Series

def remoce_comma(x):
    
    return int(x.replace(",",""))

s = pd.Series(['1,234','5,678','9,876'])

result = s.map(remove_comma)

print(result)

0    1234
1    5678
2    9876
dtype: int64

In [54]:
def is_greater_than_5000(x):
    
    if x > 5000:
        return '크다'
    
    else: 
        return '작다'
    

s = pd.Series([1234,5678,9876])

result = s.map(is_greater_than_5000)

result

0    작다
1    크다
2    크다
dtype: object

# series 객체에 비교연산 적용

In [55]:
s = pd.Series([70000,80000,75000,60000,65000], index = ['2024-06-01','2024-06-02', '2024-06-03','2024-06-04','2024-06-05'])

cond = s> 70000

s[cond]

2024-06-02    80000
2024-06-03    75000
dtype: int64

In [56]:
print(cond)

2024-06-01    False
2024-06-02     True
2024-06-03     True
2024-06-04    False
2024-06-05    False
dtype: bool

In [57]:
close = [42500,42550,41800,42550,42650]
open = [42600,42200,41850,42550,42500]

index =['2024-06-01','2024-06-02','2024-06-03','2024-06-04','2024-06-05']

open_data = pd.Series(open, index = index)
close_data = pd.Series(close, index = index)

cond = close_data > open_data

In [58]:
cond

2024-06-01    False
2024-06-02     True
2024-06-03    False
2024-06-04    False
2024-06-05     True
dtype: bool

In [59]:
close_data[cond]

2024-06-02    42550
2024-06-05    42650
dtype: int64

# 3.10 정렬 및 순위

In [60]:
index = ['000010','000020','000030','000040']
per = [3.1,2.0,10.1,5.1]

s = pd.Series(data =per, index = index)

In [62]:
# 정렬, 오름차순

s1 = s.sort_values()

s1

000020     2.0
000010     3.1
000040     5.1
000030    10.1
dtype: float64

In [63]:
# 내림차순

s2 = s.sort_values(ascending=False)

s2

000030    10.1
000040     5.1
000010     3.1
000020     2.0
dtype: float64

In [67]:
s.rank(ascending=False) # 큰 값이 1등

000010    3.0
000020    4.0
000030    1.0
000040    2.0
dtype: float64

In [66]:
s

000010     3.1
000020     2.0
000030    10.1
000040     5.1
dtype: float64

# 데이터 프레임 소개 및 생성

In [68]:
# 열방향

data = {
    
    '종목코드': ['037730','036360','005760'],
    '종목명': ['3R','3SOFT','ACTS'],
    '현재가': [1510,1790,1185]
}

df = pd.DataFrame(data)

df

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [74]:
# 행방향, 이 때는 2차원 리스트로!

data = [
    
    ['037730','3R',1510],
    ['036360','3SOFT',1790],
    ['005760','ACTS',1185]
]

columns = ['종목코드','종목명','현재가']

df = pd.DataFrame(data, columns = columns)


df

     종목코드    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

In [75]:
data = [
    
    ['037730','3R',1510,7.36],
    ['036360','3SOFT',1790,1.65],
    ['005760','ACTS',1185,1.28]
]

columns = ['종목코드','종목명','현재가','등락률']

df = pd.DataFrame(data = data, columns=columns)

df = df.set_index('종목코드')

df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [76]:
data = [
    
    ['037730','3R',1510,7.36],
    ['036360','3SOFT',1790,1.65],
    ['005760','ACTS',1185,1.28]
]

columns = ['종목코드','종목명','현재가','등락률']

df = pd.DataFrame(data = data, columns=columns)

df.set_index('종목코드', inplace = True)

df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [77]:
df['현재가']

종목코드
037730    1510
036360    1790
005760    1185
Name: 현재가, dtype: int64

In [79]:
df[['현재가','등락률']]

# 인덱싱 기호인 대괄호는

         현재가   등락률
종목코드
037730  1510  7.36
036360  1790  1.65
005760  1185  1.28

In [80]:
df.loc['037730']

종목명      3R
현재가    1510
등락률    7.36
Name: 037730, dtype: object

In [81]:
df.iloc[1]

종목명    3SOFT
현재가     1790
등락률     1.65
Name: 036360, dtype: object

In [ ]:
# loc 속성으로 인덱싱한 데이터는 컬럼 이름을 인덱스로 갖는 시리즈 객체
# iloc 속성을 사용ㅎ면 행 번호로 로우 데이터를 인덱싱할 수 있음

In [82]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [83]:
df.iloc[0].loc["현재가"]

1510

In [84]:
df.iloc[0][1]

C:\Users\imtig\AppData\Local\Temp\ipykernel_30620\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

1510

In [85]:
df.loc['037730','현재가']

1510

In [86]:
df.iloc[0,1]

1510

# 4.6 특정 범위 가져오기

In [87]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [91]:
df.loc[['037730','036360']][['종목명','현재가']]

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790

In [90]:
df.iloc[[0,1]]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [92]:
cond = df['현재가'] >=1400

df[cond]

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65

In [93]:
cond

종목코드
037730     True
036360     True
005760    False
Name: 현재가, dtype: bool

In [96]:
# 현재가 1400 이상, 1700미만

cond = (df['현재가'] >=1400) & (df['현재가']<1700)

df[cond]

       종목명   현재가   등락률
종목코드
037730  3R  1510  7.36

In [97]:
s = Series([1600,1600,1600], index = df.index)

df['목표가'] = s

df

          종목명   현재가   등락률   목표가
종목코드
037730     3R  1510  7.36  1600
036360  3SOFT  1790  1.65  1600
005760   ACTS  1185  1.28  1600

In [98]:
df['괴리율'] = (df['목표가'] - df['현재가']) / df['현재가']

df['괴리율']

종목코드
037730    0.059603
036360   -0.106145
005760    0.350211
Name: 괴리율, dtype: float64

In [99]:
df

          종목명   현재가   등락률   목표가       괴리율
종목코드
037730     3R  1510  7.36  1600  0.059603
036360  3SOFT  1790  1.65  1600 -0.106145
005760   ACTS  1185  1.28  1600  0.350211

In [100]:
# ROW 추가하는 방법

df.loc['066570'] = ['LG전자', 60000, 3.84,1600,0]

In [101]:
df

          종목명    현재가   등락률   목표가       괴리율
종목코드
037730     3R   1510  7.36  1600  0.059603
036360  3SOFT   1790  1.65  1600 -0.106145
005760   ACTS   1185  1.28  1600  0.350211
066570   LG전자  60000  3.84  1600  0.000000

In [102]:
df.drop('목표가', axis = 1)

          종목명    현재가   등락률       괴리율
종목코드
037730     3R   1510  7.36  0.059603
036360  3SOFT   1790  1.65 -0.106145
005760   ACTS   1185  1.28  0.350211
066570   LG전자  60000  3.84  0.000000

In [103]:
df.drop('066570', axis = 0)

          종목명   현재가   등락률   목표가       괴리율
종목코드
037730     3R  1510  7.36  1600  0.059603
036360  3SOFT  1790  1.65  1600 -0.106145
005760   ACTS  1185  1.28  1600  0.350211

In [104]:
df.drop(['037730','005760'], axis =0 )

          종목명    현재가   등락률   목표가       괴리율
종목코드
036360  3SOFT   1790  1.65  1600 -0.106145
066570   LG전자  60000  3.84  1600  0.000000

In [105]:
print(df.columns)

print(df.index)

Index(['종목명', '현재가', '등락률', '목표가', '괴리율'], dtype='object')
Index(['037730', '036360', '005760', '066570'], dtype='object', name='종목코드')

In [106]:
df.columns = ['name', 'price', 'change', 'target', 'diff']

df.index.name = 'code'

In [107]:
df

         name  price  change  target      diff
code
037730     3R   1510    7.36    1600  0.059603
036360  3SOFT   1790    1.65    1600 -0.106145
005760   ACTS   1185    1.28    1600  0.350211
066570   LG전자  60000    3.84    1600  0.000000

#### 일부만 바꾸려고 할 때

In [111]:
df.rename(columns = {'name':'이름'}, inplace = True)

df

           이름  price  change  target      diff
code
037730     3R   1510    7.36    1600  0.059603
036360  3SOFT   1790    1.65    1600 -0.106145
005760   ACTS   1185    1.28    1600  0.350211
066570   LG전자  60000    3.84    1600  0.000000

In [115]:
df.rename(columns = {'이름':'name'}, inplace=True)

In [116]:
df

         name  price  change  target      diff
code
037730     3R   1510    7.36    1600  0.059603
036360  3SOFT   1790    1.65    1600 -0.106145
005760   ACTS   1185    1.28    1600  0.350211
066570   LG전자  60000    3.84    1600  0.000000